{
  "ru": {
    "mainTitle": "Кирилл Токар",
    "qaEngineer": "QA Engineer",
    "resume": "Резюме",
    "aboutme": "Обо мне",
    "cases": "Проекты",
    "workExp": "Опыт работы",
    "backgroundTitle": "Бекграунд",
    "backgroundText": "Я начал свой путь в тестировании с олимпиады по автоматизации тестирования на Java в 2024 году, где занял 2 место. Это стало отправной точкой для активного развития в области QA и AQA-инженерии.",
    "focusTitle": "Фокус",
    "focusText": "Фокусируюсь на автоматизации тестирования и ручном тестировании. Имею опыт работы с API, базами данных и UI. Постоянно изучаю новые инструменты и методики тестирования, чтобы повышать качество разрабатываемых продуктов. Для меня важно не просто находить баги, но и понимать их причину и предлагать решения. Сложные и новые задачи никогда не пугают меня, поскольку это просто еще одна возможность учиться и расти.",
    "approachTitle": "Подход",
    "approachText": "Мой подход к работе — это сочетание методичности и внимания к деталям. Я тщательно анализирую требования, составляю детальные тест-кейсы и сценарии, которые покрывают все возможные пользовательские пути. При автоматизации тестирования я стремлюсь создавать стабильные и поддерживаемые тесты, используя лучшие практики и паттерны проектирования.",
    "open": "Раскрыть",
    "aboutCompany": "О компании",
    "myRole": "Моя роль",
    "aeroflotTitle": "SDET-Инженер (стажировка)",
    "aeroflotPost": "Автоматизация тестирования",
    "aeroflotTime": "2025",
    "months": "5 месяцев",
    "aeroflotAbout": "SimbirSoft — IT-компания, которая предоставляет услуги по разработке и тестированию программных продуктов на заказ",
    "aeroflotRole1": "1. Разработка и поддержка автотестов для веб-приложений с использованием Java, Selenium и TestNG",
    "aeroflotRole2": "2. Создание проекта автотестов с использованием TestNG и паттернов POM, Factory, Fluent",
    "aeroflotRole3": "3. Тестирование REST API-запросов (GET, POST, PUT, DELETE)",
    "aeroflotRole4": "4. Работа с базой данных через JDBC для проверки целостности данных",
    "aeroflotRole5": "5. Настройка параллельного запуска тестов с использованием Selenium Grid",
    "aeroflotRole6": "6. Создание отчетов Allure, использование DataProvider для тест-кейсов",
    "gamlyTitle": "Обучение и курсы",
    "gamlyPost": "QA, Автоматизация, Ручное тестирование",
    "gamlyTime": "Настоящее время",
    "training1": "1. Комплексное ручное тестирование - VK Testers",
    "training2": "2. Автоматизация тестирования на Java - Udemy",
    "training3": "3. Основы тестирования ПО - Udemy",
    "training4": "4. Инструменты разработчика: Git, Docker, CI/CD - VK Курсы",
    "training5": "5. Инженер по тестированию - Нетологии",
    "freeTitle": "Достижения и олимпиады",
    "freePost": "Олимпиады, конкурсы",
    "freeTime1": "2024 - 2026",
    "achievement1": "1 место — Олимпиада «Автоматизация тестирования на Java» (2025, ВолгаИТ)",
    "achievement2": "2 место — Олимпиада «Автоматизация тестирования на Java» (2024, ВолгаИТ)",
    "achievement3": "1 место — Олимпиада СПбГУ «Киберзащитник» (2025)",
    "achievement4": "Диплом 2 степени — Конференция «Студенческая наука» (2024)",
    "achievement5": "Диплом 3 степени — Конференция «Путь к успеху» (2025, КТ МТУСИ)",
    "achievement6": "2 место — Научная конференция «Инновации в IT» (2026)",
    
    "apiCaseTitle": "API Testing",
    "apiTitle": "API",
    "apiSubtitle": "Testing",
    "aboutProject": "О проекте",
    "apiAbout": "Проект по тестированию REST API. Проведение CRUD операций, создание тест-кейсов, чек-листов, баг-репортов, а также создание окружений для тестирования.",
    "task": "Задача",
    "apiTask": "Обеспечение качества работы REST API, проверка корректности обработки данных.",
    "timeline": "Таймлайн",
    "results": "Результаты",
    "apiResult1": "1. Создана система тестирования REST API с покрытием основных сценариев",
    "apiResult2": "2. Разработаны тест-кейсы для проверки валидации данных, обработки ошибок и производительности API",
    "apiResult3": "3. Проведено полное тестирование API эндпоинтов с использованием Postman",
    "learned": "Чему научился",
    "apiLearned": "Научился тестировать REST API, проверять валидацию данных. Приобрел опыт создания тест-кейсов и чек-листов для API тестирования.",
    "technologies": "Технологии",
    
    "sslCaseTitle": "SSL Certificates and Telegram Bot",
    "sslTitle": "Bot",
    "sslSubtitle": "SSL Certificate Monitoring",
    "sslAbout": "Система мониторинга SSL сертификатов с автоматическими уведомлениями через Telegram-бота. Решение для предотвращения проблем с истекшими сертификатами и автоматизации процесса проверки.",
    "sslTask": "Разработать систему мониторинга SSL/TLS сертификатов для предотвращения сбоев из-за истекших сертификатов. Основная цель - автоматизация проверки сроков действия и своевременное оповещение ответственных лиц.",
    "sslResult1": "1. Создана стабильная система мониторинга SSL сертификатов",
    "sslResult3": "2. Настроены ежедневные уведомления в 12:00 (кроме праздников и выходных)",
    "sslLearned": "Научился работать с SSL/TLS сертификатами, их проверкой и валидацией. Приобрел опыт, разработки систем мониторинга и автоматизации рутинных задач. Углубил знания в области безопасности веб-приложений.",
    
    "uavCaseTitle": "UAV Tournament Management System",
    "uavTitle": "UAV",
    "uavSubtitle": "Tournament Management System",
    "uavAbout": "Полнофункциональное веб-приложение для управления турнирами по беспилотным летательным аппаратам (БПЛА). Система для организации, проведения и архивации результатов соревнований.",
    "uavTask": "Разработать веб-приложение для автоматизации процесса организации и проведения турниров по БПЛА. Система должна упростить регистрацию участников, ведение турнирных таблиц, подсчет результатов и архивацию данных.",
    "timelineText": "Таймлайн",
    "uavTimelinePeriod": "Ноябрь 2025 - Декабрь 2025",
    "uavTimelineDuration": "2 недели",
    "results": "Результаты",
    "uavResult1": "1. Полнофункциональная система управления турнирами с поддержкой двух этапов: отборочного и финального",
    "uavResult2": "2. Реализован полный CRUD функционал для управления турниров",
    "uavResult3": "3. Разработан пользовательский интерфейс с навигацией между разделами системы",
    "uavResult4": "4. Интеграция с базой данных для хранения и извлечения турнирных данных",
    "uavResult5": "5. Система успешно используется для проведения турниров внутри колледжа",
    "learned": "Чему научился",
    "uavLearned": "Научился проектировать и разрабатывать полный цикл веб-приложения от планирования до реализации. Приобрел опыт работы с Java и Spring Boot, проектированием базы данных и разработкой пользовательского интерфейса.",
    "technologies": "Технологии"
  },
  "en": {
    "mainTitle": "Kirill Tokar",
    "qaEngineer": "QA Engineer",
    "resume": "Resume",
    "aboutme": "About Me",
    "cases": "Projects",
    "workExp": "Work Experience",
    "backgroundTitle": "Background",
    "backgroundText": "My journey in quality assurance began at the 2024 Java Test Automation Olympiad, where I earned second place. This achievement marked the starting point for my active development in QA and AQA engineering.",
    "focusTitle": "Focus",
    "focusText": "I specialize in both test automation and manual testing, with practical experience in API, database, and UI testing. I continuously explore new testing tools and methodologies to enhance product quality. Beyond identifying defects, I prioritize root cause analysis and solution proposals. Challenging and novel tasks represent opportunities for professional growth rather than obstacles.",
    "approachTitle": "Approach",
    "approachText": "My work methodology combines systematic processes with meticulous attention to detail. I conduct thorough requirement analysis to develop comprehensive test cases and scenarios covering all potential user journeys. In test automation, I focus on building stable, maintainable test suites by implementing industry best practices and established design patterns.",
    "open": "Expand",
    "aboutCompany": "About Company",
    "myRole": "My Role",
    "aeroflotTitle": "SDET Engineer (Internship)",
    "aeroflotPost": "Test Automation",
    "aeroflotTime": "2025",
    "months": "5 months",
    "aeroflotAbout": "SimbirSoft provides comprehensive custom software development and testing services",
    "aeroflotRole1": "1. Developed and maintained automated test suites for web applications using Java, Selenium, and TestNG",
    "aeroflotRole2": "2. Implemented test automation frameworks utilizing TestNG with POM, Factory, and Fluent design patterns",
    "aeroflotRole3": "3. Conducted comprehensive REST API testing covering CRUD operations (GET, POST, PUT, DELETE)",
    "aeroflotRole4": "4. Performed database validation and integrity checks through JDBC",
    "aeroflotRole5": "5. Configured parallel test execution environments using Selenium Grid",
    "aeroflotRole6": "6. Generated comprehensive test reports with Allure and implemented DataProvider for test case management",
    "gamlyTitle": "Education & Certifications",
    "gamlyPost": "QA, Automation, Manual Testing",
    "gamlyTime": "Present",
    "training1": "1. Comprehensive Manual Testing - VK Testers",
    "training2": "2. Java Test Automation - Udemy",
    "training3": "3. Software Testing Fundamentals - Udemy",
    "training4": "4. Developer Tools: Git, Docker, CI/CD - VK Courses",
    "training5": "5. QA Engineer - Netology",
    "freeTitle": "Achievements & Competitions",
    "freePost": "Olympiads, Competitions",
    "freeTime1": "2024 - 2026",
    "achievement1": "1st Place — «Java Automation Testing» Olympiad (2025, VolgaIT)",
    "achievement2": "2nd Place — «Java Automation Testing» Olympiad (2024, VolgaIT)",
    "achievement3": "1st Place — SPbGU «Cybersecurity Specialist» Olympiad (2025)",
    "achievement4": "2nd Degree Diploma — «Student Science» Conference (2024)",
    "achievement5": "3rd Degree Diploma — «Path to Success» Conference (2025, CT MTUCI)",
    "achievement6": "2nd Place — Scientific Conference «IT Innovations» (2026)",
    
    "apiCaseTitle": "API Testing",
    "apiTitle": "API",
    "apiSubtitle": "Testing",
    "aboutProject": "Project Overview",
    "apiAbout": "A comprehensive REST API testing initiative involving CRUD operations, test case development, checklist creation, bug reporting, and testing environment setup.",
    "task": "Objective",
    "apiTask": "Ensuring REST API quality assurance through comprehensive testing and validation of data processing accuracy.",
    "timeline": "Timeline",
    "results": "Deliverables",
    "apiResult1": "1. Implemented a comprehensive REST API testing system covering primary scenarios",
    "apiResult2": "2. Developed test cases for data validation, error handling, and API performance assessment",
    "apiResult3": "3. Conducted thorough endpoint testing using Postman with complete coverage",
    "learned": "Key Learnings",
    "apiLearned": "Acquired expertise in REST API testing methodologies and data validation techniques. Developed proficiency in creating comprehensive test cases and checklists for API testing scenarios.",
    "technologies": "Technologies & Tools",
    
    "sslCaseTitle": "SSL Certificates and Telegram Bot",
    "sslTitle": "Bot",
    "sslSubtitle": "SSL Certificate Monitoring",
    "sslAbout": "A sophisticated SSL certificate monitoring system featuring automated notifications via Telegram bot. This solution proactively prevents issues related to expired certificates while automating the verification workflow.",
    "sslTask": "Develop a comprehensive SSL/TLS certificate monitoring system to prevent service disruptions caused by certificate expiration. The primary objective involves automating validity checks and implementing timely notification mechanisms for responsible personnel.",
    "sslResult1": "1. Implemented a robust SSL certificate monitoring infrastructure",
    "sslResult3": "2. Configured automated daily notifications at 12:00 (excluding holidays and weekends)",
    "sslLearned": "Gained extensive experience with SSL/TLS certificate management, validation, and verification processes. Developed expertise in monitoring system architecture and routine task automation. Enhanced knowledge of web application security protocols and best practices.",
    
    "uavCaseTitle": "UAV Tournament Management System",
    "uavTitle": "UAV",
    "uavSubtitle": "Tournament Management System",
    "uavAbout": "A full-featured web application designed for managing unmanned aerial vehicle (UAV) tournaments. The platform facilitates comprehensive tournament organization, execution, and results archival.",
    "uavTask": "Develop a web application to automate UAV tournament management processes. The system must streamline participant registration, tournament bracket management, result calculation, and data archival procedures.",
    "timelineText": "Timeline",
    "uavTimelinePeriod": "November 2025 - December 2025",
    "uavTimelineDuration": "2 weeks",
    "results": "Deliverables",
    "uavResult1": "1. Implemented a comprehensive tournament management system supporting dual-stage competitions (qualifying and final rounds)",
    "uavResult2": "2. Developed complete CRUD functionality for comprehensive tournament administration",
    "uavResult3": "3. Designed an intuitive user interface with seamless navigation between system modules",
    "uavResult4": "4. Established database integration for efficient tournament data storage and retrieval",
    "uavResult5": "5. Successfully deployed the system for internal college tournament management",
    "learned": "Key Learnings",
    "uavLearned": "Mastered full-cycle web application development from initial planning to final implementation. Gained substantial experience with Java and Spring Boot frameworks, database architecture design, and user interface development principles.",
    "technologies": "Technologies & Tools"
  }
}